IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP1_CONTROLSS_ECAP1.xml
	<register id="CONTROLSS_ECAP1_HRFLG" acronym="CONTROLSS_ECAP1_HRFLG" offset="0x4C" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Calibration period check status Flag Bit:  1 Indicates that calibration ended before PRDCHK due to overflow on one of the counters. 0 Indicates no event occurred.  Note: This bit remains latched until cleared by the user using the HRCLR [CALPRDCHKSTS] bit." range="2" rwaccess="RO"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Calibration Done Interrupt Flag Bit:  1 Indicates calibration cycle is completed 0 Indicates calibration cycle has not completed.  Note: This bit remains latched until cleared by the user using the HRCLR [CALIBDONE] bit." range="1" rwaccess="RO"/> 
		<bitfield id="CALIBINT" width="1" begin="0" end="0" resetval="0x0" description="Global calibration Interrupt Status Flag:  1 Indicates that an interrupt was generated from CALIBDONE or CALPRDCHKSTS. 0 Indicates no interrupt generated." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRCLR" acronym="CONTROLSS_ECAP1_HRCLR" offset="0x50" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Clear Calibration period check status Flag Bit:  1 Clears the CALPRDCHKSTS flag register bit. 0 No effect.  Note: H/W has priority over CPU writes if the user tries to clear a flag bit and an event occurs on the same cycle that tries to set the flag for the selected bit." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Clear Calibration Done Interrupt Flag Bit:  1 Clears the CALIBDONE interrupt flag register bit. 0 No effect.  Note: H/W has priority over CPU writes if the user tries to clear a flag bit and an event occurs on the same cycle that tries to set the flag for the selected bit." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBINT" width="1" begin="0" end="0" resetval="0x0" description="Clear Global calibration Interrupt Flag 1 Clears the Global interrupt flag and enables further interrupts to be generated if any of the event flags are set. 0 No effect." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRFRC" acronym="CONTROLSS_ECAP1_HRFRC" offset="0x54" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Force CALPRDCHKSTS flag: 0 No effect 1 Sets the CALPRDCHKSTS flag." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Force CALIBDONE flag: 0 No effect 1 Sets the CALIBDONE flag." range="1" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRCALPRD" acronym="CONTROLSS_ECAP1_HRCALPRD" offset="0x58" width="32" description="">
		<bitfield id="PRD" width="32" begin="31" end="0" resetval="0x4194303" description="Register to program calibration period. The period value is matched against HRSYSCLKCTR. On a match an interrupt is generated and the counter registers values are captured." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRSYSCLKCTR" acronym="CONTROLSS_ECAP1_HRSYSCLKCTR" offset="0x5C" width="32" description="">
		<bitfield id="HRSYSCLKCTR" width="32" begin="31" end="0" resetval="0x0" description="Current SYSCLK counter value" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRSYSCLKCAP" acronym="CONTROLSS_ECAP1_HRSYSCLKCAP" offset="0x60" width="32" description="">
		<bitfield id="HRSYSCLKCAP" width="32" begin="31" end="0" resetval="0x0" description="HRSYSCLKCTR is captures into this register at end of calibration cycle." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRCLKCTR" acronym="CONTROLSS_ECAP1_HRCLKCTR" offset="0x64" width="32" description="">
		<bitfield id="HRCLKCTR" width="32" begin="31" end="0" resetval="0x0" description="Current HRCLK counter value  Note: HRCLK is  not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRCLKCAP" acronym="CONTROLSS_ECAP1_HRCLKCAP" offset="0x68" width="32" description="">
		<bitfield id="HRCLKCAP" width="32" begin="31" end="0" resetval="0x0" description="HRCLKCTR is captures into this register at end of calibration cycle.  Note: HRCLK is  not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP1_HRDEBUGCTL" acronym="CONTROLSS_ECAP1_HRDEBUGCTL" offset="0x74" width="32" description="">
		<bitfield id="OBSERVE_SRC_SEL" width="4" begin="11" end="8" resetval="0x0" description="Select bits for selecting source for OBSERVE1 and OBSERVE2 registers 1000 HROUTH and HROUTL will read HR1OUT 1001 HROUTH and HROUTL will read HR2OUT 1010 HROUTH and HROUTL will read Capture Delayline 1 OBS1 1011 HROUTH and HROUTL will read Capture Delayline 2 OBS1 1100 HROUTH and HROUTL will read Capture Delayline 1 OBS2 1101 HROUTH and HROUTL will read Capture Delayline 2 OBS2" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="CALIB_INPUT_SEL" width="2" begin="5" end="4" resetval="0x0" description="Select bit for calibration input, can be used to get fault coverage using these inputs 00 CAPIN is one of 128 inputs selected by INPUTSEL 01 CAPIN is connected to CAPIN_MEMMAP_SOURCE 10 CAPIN is internally generated signal waveform with 8*HRCLK cycle high and 8*HRCLK cycle low, used for linearity check of capture delay line 1 11 CAPIN is internally generated signal waveform with 8*HRCLK cycle high and 8*HRCLK cycle low, delayed by half HRCLK, used for linearity check of capture delay line 2" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="CAPIN_MMAP_SOURCE" width="1" begin="2" end="2" resetval="0x0" description="Memory mapped CAPIN source Note : select CALIN source first, it may happen that you may see interrupt if MMAP source is different from current value of CAPIN. This is debug feature hence no additional HW is necessary to prevent this." range="2" rwaccess="RW"/> 
		<bitfield id="DELAYRESETDLINE" width="1" begin="1" end="1" resetval="0x0" description="Controls the reset delayline timing 0 reset is forced on next falling edge of HRCLK (1/2 cycle after capture) 1 reset is applied a cycle later (1 1/2 cycles after capture)" range="1" rwaccess="RW"/> 
		<bitfield id="DISABLEINVSEL" width="1" begin="0" end="0" resetval="0x0" description="Disable INVSEL Logic: 0 State machine controls inversion on input signal 1 CAPIN signal propagated into delay line without inversion, this means only rising edges can be measured" range="0" rwaccess="RW"/>
	</register>
